apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_tim.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_tim.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>

#include <stdbool.h>
#include <assert.h>
#include <nuttx/debug.h>

#include "xtensa.h"
#include "hardware/esp32s3_tim.h"

#include "esp32s3_tim.h"
#include "esp_irq.h"
#include "esp_gpio.h"

#include "soc/periph_defs.h"
#include "esp_private/periph_ctrl.h"

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Timer Group IDs */

enum esp32s3_tim_gid_e
{
  ESP32S3_TIM_GROUP0 = 0,  /* Timer Group 0 */
  ESP32S3_TIM_GROUP1,      /* Timer Group 1 */
};

/* Timer IDs */

enum esp32s3_tim_tid_e
{
  ESP32S3_TIM_TIMER0 = 0,  /* Timer 0 */
  ESP32S3_TIM_TIMER1,      /* Timer 1 */
};

struct esp32s3_tim_priv_s
{
  struct esp32s3_tim_ops_s *ops;
  enum esp32s3_tim_gid_e    gid;      /* Timer Group ID */
  enum esp32s3_tim_tid_e    tid;      /* Timer ID */
  uint8_t                   periph;   /* Peripheral ID */
  uint8_t                   irq;      /* Interrupt ID */
  int                       cpuint;   /* CPU interrupt assigned to this timer */
  int                       core;     /* Core that is taking care of the timer ints */
  bool                      inuse;    /* Flag indicating if the timer is in use */
  uint8_t                   priority; /* Interrupt priority */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* TIM operations ***********************************************************/

static void tim_start(struct esp32s3_tim_dev_s *dev);
static void tim_stop(struct esp32s3_tim_dev_s *dev);
static void tim_clear(struct esp32s3_tim_dev_s *dev);
static void tim_setmode(struct esp32s3_tim_dev_s *dev,
                        enum esp32s3_tim_mode_e mode);
static void tim_setclksrc(struct esp32s3_tim_dev_s *dev,
                          enum esp32s3_tim_clksrc_e src);
static void tim_setpre(struct esp32s3_tim_dev_s *dev, uint16_t pre);
static void tim_getcounter(struct esp32s3_tim_dev_s *dev, uint64_t *value);
static void tim_setcounter(struct esp32s3_tim_dev_s *dev, uint64_t value);
static void tim_reload_now(struct esp32s3_tim_dev_s *dev);
static void tim_getalarmvalue(struct esp32s3_tim_dev_s *dev,
                              uint64_t *value);
static void tim_setalarmvalue(struct esp32s3_tim_dev_s *dev, uint64_t value);
static void tim_setalarm(struct esp32s3_tim_dev_s *dev, bool enable);
static void tim_setautoreload(struct esp32s3_tim_dev_s *dev, bool enable);
static int  tim_setisr(struct esp32s3_tim_dev_s *dev, xcpt_t handler,
                       void *arg);
static void tim_enableint(struct esp32s3_tim_dev_s *dev);
static void tim_disableint(struct esp32s3_tim_dev_s *dev);
static void tim_ackint(struct esp32s3_tim_dev_s *dev);
static int  tim_checkint(struct esp32s3_tim_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* ESP32-S3 TIM ops */

struct esp32s3_tim_ops_s esp32s3_tim_ops =
{
  .start         = tim_start,
  .stop          = tim_stop,
  .clear         = tim_clear,
  .setmode       = tim_setmode,
  .getcounter    = tim_getcounter,
  .setclksrc     = tim_setclksrc,
  .setpre        = tim_setpre,
  .setcounter    = tim_setcounter,
  .reloadnow     = tim_reload_now,
  .getalarmvalue = tim_getalarmvalue,
  .setalarmvalue = tim_setalarmvalue,
  .setalarm      = tim_setalarm,
  .setautoreload = tim_setautoreload,
  .setisr        = tim_setisr,
  .enableint     = tim_enableint,
  .disableint    = tim_disableint,
  .ackint        = tim_ackint,
  .checkint      = tim_checkint
};

#ifdef CONFIG_ESP32S3_TIMER0
/* TIMER0 */

struct esp32s3_tim_priv_s g_esp32s3_tim0_priv =
{
  .ops      = &esp32s3_tim_ops,
  .gid      = ESP32S3_TIM_GROUP0,
  .tid      = ESP32S3_TIM_TIMER0,
  .periph   = ESP32S3_PERIPH_TG_T0_LEVEL,
  .irq      = ESP32S3_IRQ_TG_T0_LEVEL,
  .cpuint   = -ENOMEM,
  .core     = -ENODEV,
  .inuse    = false,
  .priority = 1,
};
#endif

#ifdef CONFIG_ESP32S3_TIMER1
/* TIMER1 */

struct esp32s3_tim_priv_s g_esp32s3_tim1_priv =
{
  .ops      = &esp32s3_tim_ops,
  .gid      = ESP32S3_TIM_GROUP0,
  .tid      = ESP32S3_TIM_TIMER1,
  .periph   = ESP32S3_PERIPH_TG_T1_LEVEL,
  .irq      = ESP32S3_IRQ_TG_T1_LEVEL,
  .cpuint   = -ENOMEM,
  .core     = -ENODEV,
  .inuse    = false,
  .priority = 1,
};
#endif

#ifdef CONFIG_ESP32S3_TIMER2
/* TIMER2 */

struct esp32s3_tim_priv_s g_esp32s3_tim2_priv =
{
  .ops      = &esp32s3_tim_ops,
  .gid      = ESP32S3_TIM_GROUP1,
  .tid      = ESP32S3_TIM_TIMER0,
  .periph   = ESP32S3_PERIPH_TG1_T0_LEVEL,
  .irq      = ESP32S3_IRQ_TG1_T0_LEVEL,
  .cpuint   = -ENOMEM,
  .core     = -ENODEV,
  .inuse    = false,
  .priority = 1,
};
#endif

