apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_tim.c
#ifdef CONFIG_ESP32S3_TIMER3
/* TIMER3 */

struct esp32s3_tim_priv_s g_esp32s3_tim3_priv =
{
  .ops      = &esp32s3_tim_ops,
  .gid      = ESP32S3_TIM_GROUP1,
  .tid      = ESP32S3_TIM_TIMER1,
  .periph   = ESP32S3_PERIPH_TG1_T1_LEVEL,
  .irq      = ESP32S3_IRQ_TG1_T1_LEVEL,
  .cpuint   = -ENOMEM,
  .core     = -ENODEV,
  .inuse    = false,
  .priority = 1,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: tim_start
 *
 * Description:
 *   Release the counter.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void tim_start(struct esp32s3_tim_dev_s *dev)
{
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;

  if (priv->tid == ESP32S3_TIM_TIMER0)
    {
      modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_EN_M, TIMG_T0_EN_M);
    }
  else
    {
      modifyreg32(TIMG_T1CONFIG_REG(priv->gid), TIMG_T1_EN_M, TIMG_T1_EN_M);
    }
}

/****************************************************************************
 * Name: tim_stop
 *
 * Description:
 *   Halt the counter.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void tim_stop(struct esp32s3_tim_dev_s *dev)
{
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;

  if (priv->tid == ESP32S3_TIM_TIMER0)
    {
      modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_EN_M, 0);
    }
  else
    {
      modifyreg32(TIMG_T1CONFIG_REG(priv->gid), TIMG_T1_EN_M, 0);
    }
}

/****************************************************************************
 * Name: tim_clear
 *
 * Description:
 *   Set the counter to zero instantly.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void tim_clear(struct esp32s3_tim_dev_s *dev)
{
  uint64_t clear_value = 0;

  DEBUGASSERT(dev != NULL);

  tim_setcounter(dev, clear_value);
  tim_reload_now(dev);
}

/****************************************************************************
 * Name: tim_setmode
 *
 * Description:
 *   Set counter mode.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   mode          - Variable indicating the counting direction (up/down).
 *
 ****************************************************************************/

static void tim_setmode(struct esp32s3_tim_dev_s *dev,
                        enum esp32s3_tim_mode_e mode)
{
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;

  if (mode == ESP32S3_TIM_MODE_DOWN)
    {
      if (priv->tid == ESP32S3_TIM_TIMER0)
        {
          modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_INCREASE_M, 0);
        }
      else
        {
          modifyreg32(TIMG_T1CONFIG_REG(priv->gid), TIMG_T1_INCREASE_M, 0);
        }
    }
  else if (mode == ESP32S3_TIM_MODE_UP)
    {
      if (priv->tid == ESP32S3_TIM_TIMER0)
        {
          modifyreg32(TIMG_T0CONFIG_REG(priv->gid), 0, TIMG_T0_INCREASE_M);
        }
      else
        {
          modifyreg32(TIMG_T1CONFIG_REG(priv->gid), 0, TIMG_T1_INCREASE_M);
        }
    }
}

/****************************************************************************
 * Name: tim_setclksrc
 *
 * Description:
 *   Set CLK source.
 *   NOTE: It's not necessary to configure each timer's register for clock,
 *   because it doesn't matter which timer is configured, the clock
 *   configuration will apply to the timer group.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   src           - The source, it may be APB_CLK or XTAL_CLK.
 *
 ****************************************************************************/

static void tim_setclksrc(struct esp32s3_tim_dev_s *dev,
                          enum esp32s3_tim_clksrc_e src)
{
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;

  if (src == ESP32S3_TIM_APB_CLK)
    {
      modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_USE_XTAL_M, 0);
    }
  else if (src == ESP32S3_TIM_XTAL_CLK)
    {
      modifyreg32(TIMG_T0CONFIG_REG(priv->gid), 0, TIMG_T0_USE_XTAL_M);
    }
}

/****************************************************************************
 * Name: tim_setpre
 *
 * Description:
 *    Set the prescaler.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   pre           - This is the division factor. This variable accepts
 *                   values from 0 to 65535. If pre = 0, the division factor
 *                   is 65536, if pre = 1 or 2, the division factor is 2.
 *
 ****************************************************************************/

static void tim_setpre(struct esp32s3_tim_dev_s *dev, uint16_t pre)
{
  uint32_t mask = (uint32_t)pre << TIMG_T0_DIVIDER_S;
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;

  if (priv->tid == ESP32S3_TIM_TIMER0)
    {
      modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_DIVIDER_M, mask);
    }
  else
    {
      modifyreg32(TIMG_T1CONFIG_REG(priv->gid), TIMG_T1_DIVIDER_M, mask);
    }
}

/****************************************************************************
 * Name: tim_getcounter
 *
 * Description:
 *   Get the current counter value.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - A pointer to a variable to store the current read
 *                   value from counter.
 *
 ****************************************************************************/

