apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_tim.c
static void tim_getcounter(struct esp32s3_tim_dev_s *dev, uint64_t *value)
{
  uint32_t value_32;
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;
  *value = 0;

  if (priv->tid == ESP32S3_TIM_TIMER0)
    {
      /* Dummy value (0 or 1) to latch the counter value to read it */

      putreg32(BIT(0), TIMG_T0UPDATE_REG(priv->gid));

      /* Read value */

      value_32  = getreg32(TIMG_T0HI_REG(priv->gid)); /* High 32 bits */
      *value   |= value_32;
      *value  <<= SHIFT_32;
      value_32  = getreg32(TIMG_T0LO_REG(priv->gid)); /* Low 32 bits */
      *value   |= value_32;
    }
  else
    {
      /* Dummy value (0 or 1) to latch the counter value to read it */

      putreg32(BIT(0), TIMG_T1UPDATE_REG(priv->gid));

      /* Read value */

      value_32  = getreg32(TIMG_T1HI_REG(priv->gid)); /* High 32 bits */
      *value   |= value_32;
      *value  <<= SHIFT_32;
      value_32  = getreg32(TIMG_T1LO_REG(priv->gid)); /* Low 32 bits */
      *value   |= value_32;
    }
}

/****************************************************************************
 * Name: tim_setcounter
 *
 * Description:
 *   Set the value to be loaded to the counter.
 *   If you want the counter to be loaded at an alarm, enable the alarm and
 *   the auto-reload before.
 *   If you want the counter to be loaded instantly, call
 *   tim_reload_now() after this function.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - The value to be loaded the counter.
 *
 ****************************************************************************/

static void tim_setcounter(struct esp32s3_tim_dev_s *dev, uint64_t value)
{
  uint64_t low_64 = value & LOW_32_MASK;
  uint64_t high_64;
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;

  high_64 = (value >> SHIFT_32) & LOW_22_MASK;

  /* Set the counter value */

  if (priv->tid == ESP32S3_TIM_TIMER0)
    {
      putreg32((uint32_t)low_64, TIMG_T0LOADLO_REG(priv->gid));
      putreg32((uint32_t)high_64, TIMG_T0LOADHI_REG(priv->gid));
    }
  else
    {
      putreg32((uint32_t)low_64, TIMG_T1LOADLO_REG(priv->gid));
      putreg32((uint32_t)high_64, TIMG_T1LOADHI_REG(priv->gid));
    }
}

/****************************************************************************
 * Name: tim_reload_now
 *
 * Description:
 *   Reload the counter instantly. It may be called after
 *   tim_setcounter().
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void tim_reload_now(struct esp32s3_tim_dev_s *dev)
{
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;

  /* Dummy value to trigger reloading  */

  if (priv->tid == ESP32S3_TIM_TIMER0)
    {
      putreg32(BIT(0), TIMG_T0LOAD_REG(priv->gid));
    }
  else
    {
      putreg32(BIT(0), TIMG_T1LOAD_REG(priv->gid));
    }
}

/****************************************************************************
 * Name: tim_getalarmvalue
 *
 * Description:
 *   Get the alarm value.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - Pointer to retrieve the current configured alarm value.
 *
 ****************************************************************************/

static void tim_getalarmvalue(struct esp32s3_tim_dev_s *dev, uint64_t *value)
{
  uint32_t value_32;
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;
  *value = 0;

  if (priv->tid == ESP32S3_TIM_TIMER0)
    {
      value_32  = getreg32(TIMG_T0ALARMHI_REG(priv->gid)); /* High 32 bits */
      *value   |= value_32;
      *value  <<= SHIFT_32;
      value_32  = getreg32(TIMG_T0ALARMLO_REG(priv->gid)); /* Low 32 bits */
      *value   |= value_32;
    }
  else
    {
      value_32  = getreg32(TIMG_T1ALARMHI_REG(priv->gid)); /* High 32 bits */
      *value   |= value_32;
      *value  <<= SHIFT_32;
      value_32  = getreg32(TIMG_T1ALARMLO_REG(priv->gid)); /* Low 32 bits */
      *value   |= value_32;
    }
}

/****************************************************************************
 * Name: tim_setalarmvalue
 *
 * Description:
 *   Set the value that will trigger an alarm when the
 *   counter value matches this value.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - The alarm value.
 *
 ****************************************************************************/

static void tim_setalarmvalue(struct esp32s3_tim_dev_s *dev, uint64_t value)
{
  uint64_t low_64  = value & LOW_32_MASK;
  uint64_t high_64 = (value >> SHIFT_32) & LOW_22_MASK;
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;

  /* Set an alarm value */

  if (priv->tid == ESP32S3_TIM_TIMER0)
    {
      putreg32((uint32_t)low_64, TIMG_T0ALARMLO_REG(priv->gid));
      putreg32((uint32_t)high_64, TIMG_T0ALARMHI_REG(priv->gid));
    }
  else
    {
      putreg32((uint32_t)low_64, TIMG_T1ALARMLO_REG(priv->gid));
      putreg32((uint32_t)high_64, TIMG_T1ALARMHI_REG(priv->gid));
    }
}

/****************************************************************************
 * Name: tim_setalarm
 *
 * Description:
 *   Enable/Disable the alarm.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   enable        - A variable to indicate the action. If true, enable
 *                   the alarm, if false, disable it.
 *
 ****************************************************************************/

static void tim_setalarm(struct esp32s3_tim_dev_s *dev, bool enable)
{
  struct esp32s3_tim_priv_s *priv;

  DEBUGASSERT(dev != NULL);

  priv = (struct esp32s3_tim_priv_s *)dev;

  if (priv->tid == ESP32S3_TIM_TIMER0)
    {
      if (enable)
        {
          modifyreg32(TIMG_T0CONFIG_REG(priv->gid), 0, TIMG_T0_ALARM_EN_M);
        }
      else
        {
          modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_ALARM_EN_M, 0);
        }
    }
  else
    {
      if (enable)
        {
          modifyreg32(TIMG_T1CONFIG_REG(priv->gid), 0, TIMG_T1_ALARM_EN_M);
        }
      else
        {
          modifyreg32(TIMG_T1CONFIG_REG(priv->gid), TIMG_T1_ALARM_EN_M, 0);
        }
    }
}

/****************************************************************************
 * Name: tim_setautoreload
 *
 * Description:
 *   Enable or disable the auto reload.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   enable        - A variable to indicate the action. If it is true,
 *                   enable the auto reload, if false,
 *                   disable auto reload.
 *
 ****************************************************************************/

